Revit 2026 API
WireSizeSet.Erase Method
Removes a specified wire size from the set.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public virtual int Erase(
	WireSize item
)
Public Overridable Function Erase (
	item As WireSize
) As Integer
public:
virtual int Erase(
	WireSize^ item
)
abstract Erase :
        item : WireSize -> int
override Erase :
        item : WireSize -> int
Parameters
item WireSize
The wire size to be erased.
Return Value
Int32
The number of wire sizes that were erased from the set.
See Also
Reference
WireSizeSet Class
Autodesk.Revit.DB.Electrical Namespace